controllers/MenuController.php

SELECT * FROM `settings` WHERE `id`=1
SELECT * FROM `dishs` WHERE `id_vendor`=2
SELECT * FROM `menu_items`
---
    public function actionMenu()
    {
        $session = Yii::$app->session;
        // открываем сессию
        $session->open();
        $acriv_vendor = Settings::findOne(1); //Получаем активный вендор
        $dishs = Dishs::find()->where(['id_vendor' => $acriv_vendor->id_vendor])->all();
        $catalog = MenuItems::find()->all();