controllers/SiteController.php

SELECT * FROM `dishs`
---
    public function actionIndex()
    {
        $session = Yii::$app->session;
        // открываем сессию
        $session->open();
        $session = Yii::$app->session;
        if (!isset($session['language']))
        $dishs = Dishs::find()->all();  //::find()->all();